robbym/llvm-project/llvm/lib/Target/DSPIC/DSPICISelDAGToDAG.cpp
//===-- DSPICISelDAGToDAG.cpp - A dag to dag inst selector for DSPIC ----===//
//
// Part of the LLVM Project, under the Apache License v2.0 with LLVM Exceptions.
// See https://llvm.org/LICENSE.txt for license information.
// SPDX-License-Identifier: Apache-2.0 WITH LLVM-exception
//
//===----------------------------------------------------------------------===//
//
// This file defines an instruction selector for the DSPIC target.
//
//===----------------------------------------------------------------------===//

#include "DSPIC.h"
#include "DSPICSelectionDAGInfo.h"
#include "DSPICTargetMachine.h"
#include "llvm/CodeGen/MachineFrameInfo.h"
#include "llvm/CodeGen/MachineFunction.h"
#include "llvm/CodeGen/SelectionDAG.h"
#include "llvm/CodeGen/SelectionDAGISel.h"
#include "llvm/Config/llvm-config.h"
#include "llvm/IR/Constants.h"
#include "llvm/IR/Function.h"
#include "llvm/IR/GlobalVariable.h"
#include "llvm/Support/Debug.h"
#include "llvm/Support/ErrorHandling.h"
#include "llvm/Support/raw_ostream.h"
using namespace llvm;

#define DEBUG_TYPE "dspic-isel"
#define PASS_NAME "DSPIC DAG->DAG Pattern Instruction Selection"

namespace {
  struct DSPICISelAddressMode {
    enum {
      RegBase,
      FrameIndexBase
    } BaseType = RegBase;

    struct {            // This is really a union, discriminated by BaseType!
      SDValue Reg;
      int FrameIndex = 0;
    } Base;

    int16_t Disp = 0;
    const GlobalValue *GV = nullptr;
    const Constant *CP = nullptr;
    const BlockAddress *BlockAddr = nullptr;
    const char *ES = nullptr;
    int JT = -1;
    Align Alignment; // CP alignment.

    DSPICISelAddressMode() = default;

    bool hasSymbolicDisplacement() const {
      return GV != nullptr || CP != nullptr || ES != nullptr || JT != -1;
    }

#if !defined(NDEBUG) || defined(LLVM_ENABLE_DUMP)
    LLVM_DUMP_METHOD void dump() {
      errs() << "DSPICISelAddressMode " << this << '\n';
      if (BaseType == RegBase && Base.Reg.getNode() != nullptr) {
        errs() << "Base.Reg ";
        Base.Reg.getNode()->dump();
      } else if (BaseType == FrameIndexBase) {
        errs() << " Base.FrameIndex " << Base.FrameIndex << '\n';
      }
      errs() << " Disp " << Disp << '\n';
      if (GV) {
        errs() << "GV ";
        GV->dump();
      } else if (CP) {
        errs() << " CP ";
        CP->dump();
        errs() << " Align" << Alignment.value() << '\n';
      } else if (ES) {
        errs() << "ES ";
        errs() << ES << '\n';
      } else if (JT != -1)
        errs() << " JT" << JT << " Align" << Alignment.value() << '\n';
    }
#endif
  };
}

/// DSPICDAGToDAGISel - DSPIC specific code to select DSPIC machine
/// instructions for SelectionDAG operations.
///
namespace {
  class DSPICDAGToDAGISel : public SelectionDAGISel {
  public:
    DSPICDAGToDAGISel() = delete;

    DSPICDAGToDAGISel(DSPICTargetMachine &TM, CodeGenOptLevel OptLevel)
        : SelectionDAGISel(TM, OptLevel) {}

  private:
    bool MatchAddress(SDValue N, DSPICISelAddressMode &AM);
    bool MatchWrapper(SDValue N, DSPICISelAddressMode &AM);
    bool MatchAddressBase(SDValue N, DSPICISelAddressMode &AM);

    bool SelectInlineAsmMemoryOperand(const SDValue &Op,
                                      InlineAsm::ConstraintCode ConstraintID,
                                      std::vector<SDValue> &OutOps) override;

    // Include the pieces autogenerated from the target description.
  #include "DSPICGenDAGISel.inc"

    // Main method to transform nodes into machine nodes.
    void Select(SDNode *N) override;

    bool tryIndexedLoad(SDNode *Op);
    bool tryIndexedStore(SDNode *Op);
    bool tryIndexedBinOp(SDNode *Op, SDValue N1, SDValue N2, unsigned Opc8,
                         unsigned Opc16);

    bool SelectAddr(SDValue Addr, SDValue &Base, SDValue &Disp);
    bool SelectFileAddr(SDValue Addr, SDValue &Base, SDValue &Disp);
  };

  class DSPICDAGToDAGISelLegacy : public SelectionDAGISelLegacy {
  public:
    static char ID;
    DSPICDAGToDAGISelLegacy(DSPICTargetMachine &TM, CodeGenOptLevel OptLevel)
        : SelectionDAGISelLegacy(
              ID, std::make_unique<DSPICDAGToDAGISel>(TM, OptLevel)) {}
  };
}  // end anonymous namespace

char DSPICDAGToDAGISelLegacy::ID;

INITIALIZE_PASS(DSPICDAGToDAGISelLegacy, DEBUG_TYPE, PASS_NAME, false, false)

/// createDSPICISelDag - This pass converts a legalized DAG into a
/// DSPIC-specific DAG, ready for instruction scheduling.
///
FunctionPass *llvm::createDSPICISelDag(DSPICTargetMachine &TM,
                                        CodeGenOptLevel OptLevel) {
  return new DSPICDAGToDAGISelLegacy(TM, OptLevel);
}

DSPICISelDAGToDAGPass::DSPICISelDAGToDAGPass(DSPICTargetMachine &TM,
                                               CodeGenOptLevel OptLevel)
    : SelectionDAGISelPass(std::make_unique<DSPICDAGToDAGISel>(TM, OptLevel)) {
}

/// MatchWrapper - Try to match DSPICISD::Wrapper node into an addressing mode.
/// These wrap things that will resolve down into a symbol reference.  If no
/// match is possible, this returns true, otherwise it returns false.
bool DSPICDAGToDAGISel::MatchWrapper(SDValue N, DSPICISelAddressMode &AM) {
  // If the addressing mode already has a symbol as the displacement, we can
  // never match another symbol.
  if (AM.hasSymbolicDisplacement())
    return true;
  // L1f-h (trellis session 88): dsPIC has NO `[Wn + symbol]` form -- a symbol reaches the
  // ALU/move only as a bare file address (no register). So a symbol is never folded on top of
  // a register base; the symbol is materialized (`mov #_sym,Wn ; add`) and a pure register
  // base used, which is cc1's `arr[i]` shape. The red printed `mov.w [w0+_tbl],w0`, refused.
  if (AM.BaseType == DSPICISelAddressMode::RegBase && AM.Base.Reg.getNode())
    return true;

  SDValue N0 = N.getOperand(0);

  if (GlobalAddressSDNode *G = dyn_cast<GlobalAddressSDNode>(N0)) {
    AM.GV = G->getGlobal();
    AM.Disp += G->getOffset();
    //AM.SymbolFlags = G->getTargetFlags();
  } else if (ConstantPoolSDNode *CP = dyn_cast<ConstantPoolSDNode>(N0)) {
    AM.CP = CP->getConstVal();
    AM.Alignment = CP->getAlign();
    AM.Disp += CP->getOffset();
    //AM.SymbolFlags = CP->getTargetFlags();
  } else if (ExternalSymbolSDNode *S = dyn_cast<ExternalSymbolSDNode>(N0)) {
    AM.ES = S->getSymbol();
    //AM.SymbolFlags = S->getTargetFlags();
  } else if (JumpTableSDNode *J = dyn_cast<JumpTableSDNode>(N0)) {
    AM.JT = J->getIndex();
    //AM.SymbolFlags = J->getTargetFlags();
  } else {
    AM.BlockAddr = cast<BlockAddressSDNode>(N0)->getBlockAddress();
    //AM.SymbolFlags = cast<BlockAddressSDNode>(N0)->getTargetFlags();
  }
  return false;
}

/// MatchAddressBase - Helper for MatchAddress. Add the specified node to the
/// specified addressing mode without any further recursion.
bool DSPICDAGToDAGISel::MatchAddressBase(SDValue N, DSPICISelAddressMode &AM) {
  // Is the base register already occupied?
  if (AM.BaseType != DSPICISelAddressMode::RegBase || AM.Base.Reg.getNode()) {
    // If so, we cannot select it.
    return true;
  }
  // L1f-h (trellis session 88): and a register base is never added on top of a symbol, the
  // other order of the same illegal `[Wn + symbol]` -- so the symbol stays a bare file
  // address and the whole `add(index, symbol)` becomes one materialized register instead.
  if (AM.hasSymbolicDisplacement())
    return true;

  // Default, generate it as a register.
  AM.BaseType = DSPICISelAddressMode::RegBase;
  AM.Base.Reg = N;
  return false;
}

bool DSPICDAGToDAGISel::MatchAddress(SDValue N, DSPICISelAddressMode &AM) {
  LLVM_DEBUG(errs() << "MatchAddress: "; AM.dump());

  switch (N.getOpcode()) {
  default: break;
  case ISD::Constant: {
    uint64_t Val = cast<ConstantSDNode>(N)->getSExtValue();
    AM.Disp += Val;
    return false;
  }

  case DSPICISD::Wrapper:
    if (!MatchWrapper(N, AM))
      return false;
    break;

  case ISD::FrameIndex:
    if (AM.BaseType == DSPICISelAddressMode::RegBase
        && AM.Base.Reg.getNode() == nullptr) {
      AM.BaseType = DSPICISelAddressMode::FrameIndexBase;
      AM.Base.FrameIndex = cast<FrameIndexSDNode>(N)->getIndex();
      return false;
    }
    break;

  case ISD::ADD: {
    DSPICISelAddressMode Backup = AM;
    if (!MatchAddress(N.getNode()->getOperand(0), AM) &&
        !MatchAddress(N.getNode()->getOperand(1), AM))
      return false;
    AM = Backup;
    if (!MatchAddress(N.getNode()->getOperand(1), AM) &&
        !MatchAddress(N.getNode()->getOperand(0), AM))
      return false;
    AM = Backup;

    break;
  }

  case ISD::OR:
    // Handle "X | C" as "X + C" iff X is known to have C bits clear.
    if (ConstantSDNode *CN = dyn_cast<ConstantSDNode>(N.getOperand(1))) {
      DSPICISelAddressMode Backup = AM;
      uint64_t Offset = CN->getSExtValue();
      // Start with the LHS as an addr mode.
      if (!MatchAddress(N.getOperand(0), AM) &&
          // Address could not have picked a GV address for the displacement.
          AM.GV == nullptr &&
          // Check to see if the LHS & C is zero.
          CurDAG->MaskedValueIsZero(N.getOperand(0), CN->getAPIntValue())) {
        AM.Disp += Offset;
        return false;
      }
      AM = Backup;
    }
    break;
  }

  return MatchAddressBase(N, AM);
}

/// SelectAddr - returns true if it is able pattern match an addressing mode.
/// It returns the operands which make up the maximal addressing mode it can
/// match by reference.
bool DSPICDAGToDAGISel::SelectAddr(SDValue N,
                                    SDValue &Base, SDValue &Disp) {
  DSPICISelAddressMode AM;

  if (MatchAddress(N, AM))
    return false;

  if (AM.BaseType == DSPICISelAddressMode::RegBase)
    if (!AM.Base.Reg.getNode())
      AM.Base.Reg = CurDAG->getRegister(DSPIC::SR, MVT::i16);

  Base = (AM.BaseType == DSPICISelAddressMode::FrameIndexBase)
             ? CurDAG->getTargetFrameIndex(
                   AM.Base.FrameIndex,
                   N.getValueType())
             : AM.Base.Reg;

  if (AM.GV)
    Disp = CurDAG->getTargetGlobalAddress(AM.GV, SDLoc(N),
                                          MVT::i16, AM.Disp,
                                          0/*AM.SymbolFlags*/);
  else if (AM.CP)
    Disp = CurDAG->getTargetConstantPool(AM.CP, MVT::i16, AM.Alignment, AM.Disp,
                                         0 /*AM.SymbolFlags*/);
  else if (AM.ES)
    Disp = CurDAG->getTargetExternalSymbol(AM.ES, MVT::i16, 0/*AM.SymbolFlags*/);
  else if (AM.JT != -1)
    Disp = CurDAG->getTargetJumpTable(AM.JT, MVT::i16, 0/*AM.SymbolFlags*/);
  else if (AM.BlockAddr)
    Disp = CurDAG->getTargetBlockAddress(AM.BlockAddr, MVT::i32, 0,
                                         0/*AM.SymbolFlags*/);
  else
    Disp = CurDAG->getSignedTargetConstant(AM.Disp, SDLoc(N), MVT::i16);

  return true;
}

/// SelectFileAddr (L1f-g, trellis session 87): a symbol with a folded offset and NO register
/// base -- the near-data file address the bit forms and the file-form bfext take. It prints
/// as the bare symbol (the SR base is printSrcMemOperand's "no register"). A register base
/// or a frame slot is refused, so those take the register or [Wn] forms.
bool DSPICDAGToDAGISel::SelectFileAddr(SDValue N, SDValue &Base, SDValue &Disp) {
  DSPICISelAddressMode AM;
  if (MatchAddress(N, AM))
    return false;
  if (AM.BaseType != DSPICISelAddressMode::RegBase || AM.Base.Reg.getNode())
    return false;
  if (!AM.GV && !AM.ES)
    return false;
  // Session 90: a FAR data object (the "far" attribute clang forwards from
  // `__attribute__((far))`) lies outside the 13-bit file-register field, so no f-form takes it;
  // cc1 keeps the 16-bit `mov f,Wnd`/`mov Wns,f` (SelectAddr's symbolic form -- that
  // instruction's field is 16 bits) and materialises the address for everything else
  // (`mov #_farbuf,w0 ; inc.w [w0],[w0]`), which refusing here reproduces.
  if (AM.GV)
    if (const auto *GVar = dyn_cast<GlobalVariable>(AM.GV))
      if (GVar->hasAttribute("far"))
        return false;
  Base = CurDAG->getRegister(DSPIC::SR, MVT::i16);
  if (AM.GV)
    Disp = CurDAG->getTargetGlobalAddress(AM.GV, SDLoc(N), MVT::i16, AM.Disp, 0);
  else
    Disp = CurDAG->getTargetExternalSymbol(AM.ES, MVT::i16, 0);
  return true;
}

bool DSPICDAGToDAGISel::SelectInlineAsmMemoryOperand(
    const SDValue &Op, InlineAsm::ConstraintCode ConstraintID,
    std::vector<SDValue> &OutOps) {
  SDValue Op0, Op1;
  switch (ConstraintID) {
  default: return true;
  case InlineAsm::ConstraintCode::m: // memory
    if (!SelectAddr(Op, Op0, Op1))
      return true;
    break;
  }

  OutOps.push_back(Op0);
  OutOps.push_back(Op1);
  return false;
}

static bool isValidIndexedLoad(const LoadSDNode *LD) {
  ISD::MemIndexedMode AM = LD->getAddressingMode();
  // L1f-f: all four modes
  if (AM == ISD::UNINDEXED || LD->getExtensionType() != ISD::NON_EXTLOAD)
    return false;

  EVT VT = LD->getMemoryVT();

  switch (VT.getSimpleVT().SimpleTy) {
  case MVT::i8:
    if (LD->getOffset()->getAsZExtVal() != 1)
      return false;

    break;
  case MVT::i16:
    if (LD->getOffset()->getAsZExtVal() != 2)
      return false;

    break;
  default:
    return false;
  }

  return true;
}

bool DSPICDAGToDAGISel::tryIndexedLoad(SDNode *N) {
  LoadSDNode *LD = cast<LoadSDNode>(N);
  if (!isValidIndexedLoad(LD))
    return false;

  MVT VT = LD->getMemoryVT().getSimpleVT();

  // L1f-f: the mode picks the spelling -- [Wn++] [Wn--] [++Wn] [--Wn]
  static const unsigned Ops16[] = {DSPIC::MOV16rpi, DSPIC::MOV16rpdd, DSPIC::MOV16rp, DSPIC::MOV16rpd};
  static const unsigned Ops8[]  = {DSPIC::MOV8rpi,  DSPIC::MOV8rpdd,  DSPIC::MOV8rp,  DSPIC::MOV8rpd};
  unsigned Mode = LD->getAddressingMode() - ISD::PRE_INC; // PRE_INC, PRE_DEC, POST_INC, POST_DEC
  unsigned Opcode = 0;
  switch (VT.SimpleTy) {
  case MVT::i8:
    Opcode = Ops8[Mode];
    break;
  case MVT::i16:
    Opcode = Ops16[Mode];
    break;
  default:
    return false;
  }

  ReplaceNode(N,
              CurDAG->getMachineNode(Opcode, SDLoc(N), VT, MVT::i16, MVT::Other,
                                     LD->getBasePtr(), LD->getChain()));
  return true;
}

// L1f-f: the [Wn--] twin of each untied post-increment ALU source form
static unsigned postDecOf(unsigned Opc) {
  switch (Opc) {
  case DSPIC::ADDM16rpu: return DSPIC::ADDM16rpd;
  case DSPIC::ADDM8rpu:  return DSPIC::ADDM8rpd;
  case DSPIC::SUBM16rpu: return DSPIC::SUBM16rpd;
  case DSPIC::SUBM8rpu:  return DSPIC::SUBM8rpd;
  case DSPIC::SUBRM16rpu: return DSPIC::SUBRM16rpd;
  case DSPIC::SUBRM8rpu:  return DSPIC::SUBRM8rpd;
  case DSPIC::ANDM16rpu: return DSPIC::ANDM16rpd;
  case DSPIC::ANDM8rpu:  return DSPIC::ANDM8rpd;
  case DSPIC::IORM16rpu: return DSPIC::IORM16rpd;
  case DSPIC::IORM8rpu:  return DSPIC::IORM8rpd;
  case DSPIC::XORM16rpu: return DSPIC::XORM16rpd;
  case DSPIC::XORM8rpu:  return DSPIC::XORM8rpd;
  default: return Opc;
  }
}

bool DSPICDAGToDAGISel::tryIndexedBinOp(SDNode *Op, SDValue N1, SDValue N2,
                                         unsigned Opc8, unsigned Opc16) {
  if (N1.getOpcode() == ISD::LOAD &&
      N1.hasOneUse() &&
      IsLegalToFold(N1, Op, Op, OptLevel)) {
    LoadSDNode *LD = cast<LoadSDNode>(N1);
    if (!isValidIndexedLoad(LD))
      return false;
    // L1f-f: the untied three-operand form takes [Wn++] and [Wn--] as its source; the
    // opcodes passed in are the post-increment ones, the decrement is the next def
    ISD::MemIndexedMode AM = LD->getAddressingMode();
    if (AM != ISD::POST_INC && AM != ISD::POST_DEC)
      return false;

    MVT VT = LD->getMemoryVT().getSimpleVT();
    unsigned Opc = (VT == MVT::i16 ? Opc16 : Opc8);
    if (AM == ISD::POST_DEC)
      Opc = postDecOf(Opc);
    MachineMemOperand *MemRef = cast<MemSDNode>(N1)->getMemOperand();
    SDValue Ops0[] = { N2, LD->getBasePtr(), LD->getChain() };
    SDNode *ResNode =
      CurDAG->SelectNodeTo(Op, Opc, VT, MVT::i16, MVT::Other, Ops0);
    CurDAG->setNodeMemRefs(cast<MachineSDNode>(ResNode), {MemRef});
    // Transfer chain.
    ReplaceUses(SDValue(N1.getNode(), 2), SDValue(ResNode, 2));
    // Transfer writeback.
    ReplaceUses(SDValue(N1.getNode(), 1), SDValue(ResNode, 1));
    return true;
  }

  return false;
}



// L1f-f (trellis session 87): an indexed store -- the pointer moves by the access width,
// [Wn++] [Wn--] [++Wn] [--Wn] -- prints as one instruction: `mov.w Ws,[Wn++]`, `clr.w
// [Wn++]` for a zero, `setm.w [Wn++]` for all ones, and `mov.w [Ws++],[Wd++]` / `mov.w
// [--Ws],[--Wd]` when the value is itself an indexed load of the same kind with no other
// use (the copy loops). The node's results are (writeback, chain).
bool DSPICDAGToDAGISel::tryIndexedStore(SDNode *N) {
  StoreSDNode *ST = cast<StoreSDNode>(N);
  ISD::MemIndexedMode AM = ST->getAddressingMode();
  if (AM == ISD::UNINDEXED || ST->isTruncatingStore())
    return false;
  MVT VT = ST->getMemoryVT().getSimpleVT();
  if (VT != MVT::i8 && VT != MVT::i16)
    return false;
  unsigned Mode = AM - ISD::PRE_INC; // PRE_INC, PRE_DEC, POST_INC, POST_DEC
  SDLoc dl(N);
  SDValue Val = ST->getValue(), Ptr = ST->getBasePtr(), Chain = ST->getChain();
  // memory to memory: the value is an indexed load of the same kind, used only here
  if (auto *LD = dyn_cast<LoadSDNode>(Val)) {
    ISD::MemIndexedMode LAM = LD->getAddressingMode();
    bool Same = LAM == AM; // the same mode on both sides: four spellings
    if (Same && LD->getExtensionType() == ISD::NON_EXTLOAD && Val.hasOneUse() &&
        LD->getMemoryVT() == VT && IsLegalToFold(Val, N, N, OptLevel)) {
      static const unsigned P16[] = {DSPIC::MOV16ppii, DSPIC::MOV16ppdd, DSPIC::MOV16pp, DSPIC::MOV16ppd};
      static const unsigned P8[]  = {DSPIC::MOV8ppii,  DSPIC::MOV8ppdd,  DSPIC::MOV8pp,  DSPIC::MOV8ppd};
      unsigned Opc = VT == MVT::i16 ? P16[Mode] : P8[Mode];
      SDValue Ops[] = {LD->getBasePtr(), Ptr, LD->getChain()};
      SDNode *R = CurDAG->getMachineNode(Opc, dl, MVT::i16, MVT::i16, MVT::Other, Ops);
      CurDAG->setNodeMemRefs(cast<MachineSDNode>(R), {LD->getMemOperand(), ST->getMemOperand()});
      ReplaceUses(SDValue(LD, 1), SDValue(R, 0)); // the source pointer's writeback
      ReplaceUses(SDValue(LD, 2), SDValue(R, 2)); // the load's chain
      ReplaceUses(SDValue(N, 0), SDValue(R, 1));  // the destination's writeback
      ReplaceUses(SDValue(N, 1), SDValue(R, 2));  // the store's chain
      CurDAG->RemoveDeadNode(N);
      return true;
    }
  }
  unsigned Opc = 0;
  if (auto *C = dyn_cast<ConstantSDNode>(Val)) {
    if (C->isZero() && AM == ISD::POST_INC)
      Opc = VT == MVT::i16 ? DSPIC::CLR16p : DSPIC::CLR8p;
    else if (C->isAllOnes() && AM == ISD::POST_INC && VT == MVT::i16)
      Opc = DSPIC::SETM16p;
  }
  if (Opc) {
    SDValue Ops[] = {Ptr, Chain};
    SDNode *R = CurDAG->getMachineNode(Opc, dl, MVT::i16, MVT::Other, Ops);
    CurDAG->setNodeMemRefs(cast<MachineSDNode>(R), {ST->getMemOperand()});
    ReplaceNode(N, R);
    return true;
  }
  static const unsigned Ops16[] = {DSPIC::MOV16pri, DSPIC::MOV16prdd, DSPIC::MOV16pr, DSPIC::MOV16prd};
  static const unsigned Ops8[]  = {DSPIC::MOV8pri,  DSPIC::MOV8prdd,  DSPIC::MOV8pr,  DSPIC::MOV8prd};
  Opc = VT == MVT::i16 ? Ops16[Mode] : Ops8[Mode];
  SDValue Ops[] = {Val, Ptr, Chain};
  SDNode *R = CurDAG->getMachineNode(Opc, dl, MVT::i16, MVT::Other, Ops);
  CurDAG->setNodeMemRefs(cast<MachineSDNode>(R), {ST->getMemOperand()});
  ReplaceNode(N, R);
  return true;
}

void DSPICDAGToDAGISel::Select(SDNode *Node) {
  SDLoc dl(Node);

  // If we have a custom node, we already have selected!
  if (Node->isMachineOpcode()) {
    LLVM_DEBUG(errs() << "== "; Node->dump(CurDAG); errs() << "\n");
    Node->setNodeId(-1);
    return;
  }

  // Few custom selection stuff.
  switch (Node->getOpcode()) {
  default: break;
  case ISD::FrameIndex: {
    assert(Node->getValueType(0) == MVT::i16);
    int FI = cast<FrameIndexSDNode>(Node)->getIndex();
    SDValue TFI = CurDAG->getTargetFrameIndex(FI, MVT::i16);
    if (Node->hasOneUse()) {
      CurDAG->SelectNodeTo(Node, DSPIC::ADDframe, MVT::i16, TFI,
                           CurDAG->getTargetConstant(0, dl, MVT::i16));
      return;
    }
    ReplaceNode(Node, CurDAG->getMachineNode(
                          DSPIC::ADDframe, dl, MVT::i16, TFI,
                          CurDAG->getTargetConstant(0, dl, MVT::i16)));
    return;
  }
  case ISD::LOAD:
    if (tryIndexedLoad(Node))
      return;
    // Other cases are autogenerated.
    break;
  case ISD::STORE:
    if (tryIndexedStore(Node))
      return;
    break;
  case ISD::ADD:
    if (tryIndexedBinOp(Node, Node->getOperand(0), Node->getOperand(1),
                        DSPIC::ADDM8rpu, DSPIC::ADDM16rpu))
      return;
    else if (tryIndexedBinOp(Node, Node->getOperand(1), Node->getOperand(0),
                             DSPIC::ADDM8rpu, DSPIC::ADDM16rpu))
      return;

    // Other cases are autogenerated.
    break;
  case ISD::SUB:
    // x - *p++ : the load is the SECOND operand; *p++ - x is the subr form
    if (tryIndexedBinOp(Node, Node->getOperand(1), Node->getOperand(0),
                        DSPIC::SUBM8rpu, DSPIC::SUBM16rpu))
      return;
    else if (tryIndexedBinOp(Node, Node->getOperand(0), Node->getOperand(1),
                             DSPIC::SUBRM8rpu, DSPIC::SUBRM16rpu))
      return;

    // Other cases are autogenerated.
    break;
  case ISD::AND:
    if (tryIndexedBinOp(Node, Node->getOperand(0), Node->getOperand(1),
                        DSPIC::ANDM8rpu, DSPIC::ANDM16rpu))
      return;
    else if (tryIndexedBinOp(Node, Node->getOperand(1), Node->getOperand(0),
                             DSPIC::ANDM8rpu, DSPIC::ANDM16rpu))
      return;

    // Other cases are autogenerated.
    break;
  case ISD::OR:
    if (tryIndexedBinOp(Node, Node->getOperand(0), Node->getOperand(1),
                        DSPIC::IORM8rpu, DSPIC::IORM16rpu))
      return;
    else if (tryIndexedBinOp(Node, Node->getOperand(1), Node->getOperand(0),
                             DSPIC::IORM8rpu, DSPIC::IORM16rpu))
      return;

    // Other cases are autogenerated.
    break;
  case ISD::XOR:
    if (tryIndexedBinOp(Node, Node->getOperand(0), Node->getOperand(1),
                        DSPIC::XORM8rpu, DSPIC::XORM16rpu))
      return;
    else if (tryIndexedBinOp(Node, Node->getOperand(1), Node->getOperand(0),
                             DSPIC::XORM8rpu, DSPIC::XORM16rpu))
      return;

    // Other cases are autogenerated.
    break;
  }

  // Select the default instruction
  SelectCode(Node);
}
